# vim: set ft=ruby

brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "block-goose-cli"
brew "btop"
brew "diff-so-fancy"
brew "direnv"
brew "eza"
brew "fzf"
brew "gcalcli"
brew "gh"
brew "git"
brew "go"
brew "gpg"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "magic-wormhole"
brew "mise"
brew "neovim"
brew "node"
brew "python"
brew "reattach-to-user-namespace"
brew "restic"
brew "ripgrep"
brew "ruby-build"
brew "stow"
brew "terraform"
brew "tmux"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zoxide"

tap "trobrock/trobrock"
brew "hush", restart_service: "always"

# UI
tap "FelixKratz/formulae"
brew "sketchybar"
cask "nikitabobko/tap/aerospace"
brew "borders"
tap "sachaos/todoist"
brew "todoist"
cask "font-caskaydia-cove-nerd-font"

# Casks
cask "1password"
cask "1password-cli"
cask "basecamp"
cask "block-goose"
cask "brave-browser"
cask "elgato-stream-deck"
cask "garmin-express"
cask "ghostty"
cask "google-drive"
cask "licecap"
cask "logi-options+"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
cask "telegram"
cask "todoist"
cask "whatsapp"
